<a href="https://colab.research.google.com/github/Archandra12/Term4-Projects/blob/main/Pandas_testINSAID.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [42]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/VideoGameSales.csv')

In [4]:
df.head(5)

   Rank                      Name  ... JP_Sales_Volume  Other_Sales_Volume
0     1                Wii Sports  ...            3.77                8.46
1     2         Super Mario Bros.  ...            6.81                0.77
2     3            Mario Kart Wii  ...            3.79                3.31
3     4         Wii Sports Resort  ...            3.28                2.96
4     5  Pokemon Red/Pokemon Blue  ...           10.22                1.00

[5 rows x 10 columns]

####Which of the following genres are in the top 5 in JP and NA region based on the total sales volume?

In [9]:
  print(df.groupby('Genre',)['NA_Sales_Volume'].sum().nlargest(7))
  df.groupby('Genre',)['JP_Sales_Volume'].sum().nlargest(7)

Genre
Action          877.83
Sports          683.35
Shooter         582.60
Platform        447.05
Misc            410.24
Racing          359.42
Role-Playing    327.28
Name: NA_Sales_Volume, dtype: float64

Genre
Role-Playing    352.31
Action          159.95
Sports          135.37
Platform        130.77
Misc            107.76
Fighting         87.35
Simulation       63.70
Name: JP_Sales_Volume, dtype: float64

####Which of the top 5 publishers enjoyed the highest amount of sales volume in the NA region?

In [10]:
 print(df.groupby('Publisher')['NA_Sales_Volume'].sum().nlargest(7))

Publisher
Nintendo                       816.87
Electronic Arts                595.07
Activision                     429.70
Sony Computer Entertainment    265.22
Ubisoft                        253.43
Take-Two Interactive           220.49
THQ                            208.77
Name: NA_Sales_Volume, dtype: float64

How many customers were attracted from Spain (SP) in at least 5 of the campaigns?

Note: Also, include the "Response" column too as it is also a campaign.

For example, AcceptedCmp1 stands for Campaign 1. Consider the columns that start with "AcceptedCmp". So in all, there are 6 campaigns.

The dataset can be imported as pandas dataframe using the following link: https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/market_data.csv

In [12]:
df_market = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/market_data.csv')
df_market.head()

      ID  Year_Birth   Education  ... Response Complain  Country
0   1826        1970  Graduation  ...        1        0       SP
1      1        1961  Graduation  ...        1        0       CA
2  10476        1958  Graduation  ...        0        0       US
3   1386        1967  Graduation  ...        0        0      AUS
4   5371        1989  Graduation  ...        1        0       SP

[5 rows x 28 columns]

In [21]:
df_market[(df_market['Country']=='SP') & (df_market['AcceptedCmp1']==1) & (df_market['AcceptedCmp2']==1) & (df_market['AcceptedCmp3']==1) & (df_market['AcceptedCmp4']==1)]

Empty DataFrame
Columns: [ID, Year_Birth, Education, Marital_Status, Income, Kidhome, Teenhome, Dt_Customer, Recency, MntWines, MntFruits, MntMeatProducts, MntFishProducts, MntSweetProducts, MntGoldProds, NumDealsPurchases, NumWebPurchases, NumCatalogPurchases, NumStorePurchases, NumWebVisitsMonth, AcceptedCmp3, AcceptedCmp4, AcceptedCmp5, AcceptedCmp1, AcceptedCmp2, Response, Complain, Country]
Index: []

Answer: 0 

####Which of the following product performed the best in terms of the average amount spent?

For example, MntFishProducts denotes the amount spent on Fish products. Consider only the columns that start with "Mnt".

In [31]:
dict = {}
for i in df_market.columns:
  if i[:3]=='Mnt':
    print(i, df_market[i].sum())
    dict[i]=df_market[i].sum()
    #print (i)

MntWines 680816
MntFruits 58917
MntMeatProducts 373968
MntFishProducts 84057
MntSweetProducts 60621
MntGoldProds 98609

In [38]:
pd.DataFrame(data=dict, index=[1]).T

                       1
MntWines          680816
MntFruits          58917
MntMeatProducts   373968
MntFishProducts    84057
MntSweetProducts   60621
MntGoldProds       98609

What is the maximum income (in USD) of the married people from IND country having 2 children with Graduation Education born after 1975?

In [77]:
df_market.head()

      ID  Year_Birth   Education Marital_Status       Income  Kidhome  Teenhome Dt_Customer  Recency  MntWines  MntFruits  MntMeatProducts  MntFishProducts  MntSweetProducts  MntGoldProds  NumDealsPurchases  NumWebPurchases  NumCatalogPurchases  NumStorePurchases  NumWebVisitsMonth  AcceptedCmp3  AcceptedCmp4  AcceptedCmp5  AcceptedCmp1  AcceptedCmp2  Response  Complain Country  total_purchases
0   1826        1970  Graduation       Divorced  $84,835.00         0         0     6/16/14        0       189        104              379              111               189           218                  1                4                    4                  6                  1             0             0             0             0             0         1         0      SP               15
1      1        1961  Graduation         Single  $57,091.00         0         0     6/15/14        0       464          5               64                7                 0            37                  1                7                    3                  7                  5             0             0             0             0             1         1         0      CA               18
2  10476        1958  Graduation        Married  $67,267.00         0         1     5/13/14        0       134         11               59               15                 2            30                  1                3                    2                  5                  2             0             0             0             0             0         0         0      US               11
3   1386        1967  Graduation       Together  $32,474.00         1         1     5/11/14        0        10          0                1                0                 0             0                  1                1                    0                  2                  7             0             0             0             0             0         0         0     AUS                4
4   5371        1989  Graduation         Single  $21,474.00         1         0      4/8/14        0         6         16               24               11                 0            34                  2                3                    1                  2                  7             1             0             0             0             0         1         0      SP                8

In [54]:
df_market[(df_market['Marital_Status']=='Married') & (df_market['Kidhome']==2) & (df_market['Education']=='Graduation')  & (df_market['Country']=='IND')  & (df_market['Year_Birth'] >1975)]['Income'].max()

'$55,357.00 '

Which country has the highest number of total purchases?

In [76]:
df_market['total_purchases'] = df_market['NumDealsPurchases'] + df_market['NumWebPurchases'] + df_market['NumCatalogPurchases']	+ df_market['NumStorePurchases']

In [82]:
df_market.groupby('Country')['total_purchases'].sum()

Country
AUS     2314
CA      4101
GER     1788
IND     2099
ME        59
SA      5117
SP     16052
US      1761
Name: total_purchases, dtype: int64

Which of the following parameter (additional) is required to read the goodreads.csv file using pandas?

The dataset can be imported as pandas dataframe using the following link: https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/goodreads.csv

In [43]:
df_goodreads = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/goodreads.csv')

In [46]:
df_goodreads.describe()

             bookID  average_rating        isbn13     num_pages  ratings_count  text_reviews_count
count  11123.000000    11123.000000  1.112300e+04  11123.000000   1.112300e+04        11123.000000
mean   21310.856963        3.934075  9.759880e+12    336.405556   1.794285e+04          542.048099
std    13094.727252        0.350485  4.429758e+11    241.152626   1.124992e+05         2576.619589
min        1.000000        0.000000  8.987060e+09      0.000000   0.000000e+00            0.000000
25%    10277.500000        3.770000  9.780345e+12    192.000000   1.040000e+02            9.000000
50%    20287.000000        3.960000  9.780582e+12    299.000000   7.450000e+02           47.000000
75%    32104.500000        4.140000  9.780872e+12    416.000000   5.000500e+03          238.000000
max    45641.000000        5.000000  9.790008e+12   6576.000000   4.597666e+06        94265.000000

Which of the following neighborhood is the most expensive in the neighbourhood_group that provides the most number of "Entire home/Apartments" room_type in NYC?

Note: You need to remove null values to get the correct answer.

The dataset can be imported as pandas dataframe using the following link: https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/AB_NYC_2019.csv

In [56]:
df_neighborhood = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/AB_NYC_2019.csv')

In [73]:
df_neighborhood.head()

     id                                              name  host_id    host_name neighbourhood_group neighbourhood  latitude  longitude        room_type  price  minimum_nights  number_of_reviews last_review  reviews_per_month  calculated_host_listings_count  availability_365
0  2539                Clean & quiet apt home by the park     2787         John            Brooklyn    Kensington  40.64749  -73.97237     Private room    149               1                  9  2018-10-19               0.21                               6               365
1  2595                             Skylit Midtown Castle     2845     Jennifer           Manhattan       Midtown  40.75362  -73.98377  Entire home/apt    225               1                 45  2019-05-21               0.38                               2               355
2  3647               THE VILLAGE OF HARLEM....NEW YORK !     4632    Elisabeth           Manhattan        Harlem  40.80902  -73.94190     Private room    150               3                  0         NaN                NaN                               1               365
3  3831                   Cozy Entire Floor of Brownstone     4869  LisaRoxanne            Brooklyn  Clinton Hill  40.68514  -73.95976  Entire home/apt     89               1                270  2019-07-05               4.64                               1               194
4  5022  Entire Apt: Spacious Studio/Loft by central park     7192        Laura           Manhattan   East Harlem  40.79851  -73.94399  Entire home/apt     80              10                  9  2018-11-19               0.10                               1                 0

In [75]:
df_neighborhood[df_neighborhood['room_type'] == 'Entire home/apt'].groupby(['neighbourhood_group', 'neighbourhood'])['price'].max()

neighbourhood_group  neighbourhood
Bronx                Allerton         450
                     Baychester       101
                     Belmont          299
                     Bronxdale        100
                     Castle Hill      128
                                     ...
Staten Island        Tottenville      299
                     West Brighton    190
                     Westerleigh      103
                     Willowbrook      249
                     Woodrow          700
Name: price, Length: 216, dtype: int64

Which TV show has the biggest cast and has a valid director name?

The dataset can be imported as pandas dataframe using the following link: https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/netflix_content.csv

In [83]:
df_netflix = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/netflix_content.csv')

In [98]:
df_netflix[(df_netflix['type'] =='TV Show') & (df_netflix['director'].notnull())]['num_cast'].nlargest(5).index

Int64Index([322, 2504, 5226, 6961, 2313], dtype='int64')

In [88]:
df_netflix.head()

  show_id     type  title           director                                               cast        country         date_added  release_year rating   duration                                          listed_in                                        description  num_cast           primary_genre
0      s1  TV Show     3%                NaN  João Miguel, Bianca Comparato, Michel Gomes, R...         Brazil    August 14, 2020          2020  TV-MA  4 Seasons  International TV Shows, TV Dramas, TV Sci-Fi &...  In a future where the elite inhabit an island ...        11  International TV Shows
1      s2    Movie   7:19  Jorge Michel Grau  Demián Bichir, Héctor Bonilla, Oscar Serrano, ...         Mexico  December 23, 2016          2016  TV-MA     93 min                       Dramas, International Movies  After a devastating earthquake hits Mexico Cit...         6                  Dramas
2      s3    Movie  23:59       Gilbert Chan  Tedd Chan, Stella Chung, Henley Hii, Lawrence ...      Singapore  December 20, 2018          2011      R     78 min                Horror Movies, International Movies  When an army recruit is found dead, his fellow...         9           Horror Movies
3      s4    Movie      9        Shane Acker  Elijah Wood, John C. Reilly, Jennifer Connelly...  United States  November 16, 2017          2009  PG-13     80 min  Action & Adventure, Independent Movies, Sci-Fi...  In a postapocalyptic world, rag-doll robots hi...         9      Action & Adventure
4      s5    Movie     21     Robert Luketic  Jim Sturgess, Kevin Spacey, Kate Bosworth, Aar...  United States    January 1, 2020          2008  PG-13    123 min                                             Dramas  A brilliant group of students become card-coun...        12                  Dramas

In [87]:
df_netflix.isnull().sum()

show_id             0
type                0
title               0
director         2389
cast              718
country           507
date_added         10
release_year        0
rating              7
duration            0
listed_in           0
description         0
num_cast            0
primary_genre       0
dtype: int64

Number of TV Shows whose title starts and ends with a H (or h)?

In [122]:
#df_netflix['title'][0][0]
df_netflix[ ((df_netflix['title'].str.startswith('H')) |  (df_netflix['title'].str.startswith('h'))) & ((df_netflix['title'].str.endswith('H')) |  (df_netflix['title'].str.endswith('h'))) ]

     show_id     type                           title           director                                               cast        country         date_added  release_year rating   duration                                          listed_in                                        description  num_cast             primary_genre
2563   s2564  TV Show                               H                NaN  Jamel Debbouze, Éric Judor, Ramzy Bedia, Cathe...         France  September 1, 2020          2002  TV-MA  4 Seasons                International TV Shows, TV Comedies  At a dysfunctional hospital in Paris, three bu...         6    International TV Shows
2574   s2575    Movie                   Hadi İnşallah  Ali Taner Baltacı  Büşra Pekin, Murat Boz, Cezmi Baskın, Şinasi Y...         Turkey      April 4, 2018          2014  TV-14     95 min    Comedies, International Movies, Romantic Movies  A young woman recovering poorly from a bad rom...        10                  Comedies
2586   s2587    Movie         Halo: The Fall of Reach          Ian Kirby  Jen Taylor, Steve Downes, Michelle Lukes, Brit...  United States      March 7, 2016          2015  TV-14     65 min               Action & Adventure, Sci-Fi & Fantasy  Witness the origins of Master Chief and the Sp...         8        Action & Adventure
2604   s2605    Movie                 Hantu Kak Limah       Mamat Khalid  Awie, Arab Khalid, Sharwani Ns, Tj Isa, Delima...       Malaysia   January 31, 2019          2018  TV-PG    110 min      Comedies, Horror Movies, International Movies  When Kak Limah turns up dead shortly after her...         8                  Comedies
2618   s2619  TV Show                        Happyish                NaN  Steve Coogan, Kathryn Hahn, Sawyer Shipman, Br...  United States       July 1, 2016          2015  TV-MA   1 Season                             TV Comedies, TV Dramas  A middle-aged adman is shaken up by his new bo...         4               TV Comedies
2645   s2646  TV Show                         Hasmukh                NaN  Vir Das, Ranvir Shorey, Manoj Pahwa, Ravi Kish...          India     April 17, 2020          2020  TV-MA   1 Season  Crime TV Shows, International TV Shows, TV Com...  A timid, small-town comedian's long-awaited bi...         8            Crime TV Shows
2676   s2677  TV Show                 Heartbreak High                NaN  Callan Mulvey, Lara Cox, Emma Roche, Ada Nicod...      Australia  November 27, 2020          1999  TV-14  7 Seasons   International TV Shows, TV Dramas, Teen TV Shows  A crash course on the turbulence of being a te...        47    International TV Shows
2756   s2757    Movie                           Hitch       Andy Tennant  Will Smith, Eva Mendes, Kevin James, Amber Val...  United States    January 1, 2020          2005  PG-13    118 min                          Comedies, Romantic Movies  Smooth and sexy Hitch helps clients make a gre...        10                  Comedies
2773   s2774    Movie                    Holiday Rush       Leslie Small  Romany Malco, Sonequa Martin-Green, Darlene Lo...  United States  November 28, 2019          2019  TV-PG     94 min                   Children & Family Movies, Dramas  A widowed radio DJ and his four spoiled kids n...         9  Children & Family Movies
2788   s2789  TV Show  Home: Adventures with Tip & Oh                NaN  Rachel Crow, Mark Whitten, Ana Ortiz, Ron Func...  United States      July 20, 2018          2018  TV-Y7  4 Seasons                              Kids' TV, TV Comedies  A misfit alien named Oh moves in with Tip and ...         6                  Kids' TV
2833   s2834    Movie              House of the Witch        Alex Merkin  Emily Bader, Darren Mann, Michelle Randolph, C...  United States   October 11, 2020          2017  TV-MA     86 min                                      Horror Movies  A group of daring teens finds themselves in a ...         8             Horror Movies
2854   s2855    Movie                      Hridaynath         Amar Gupte  Jackie Shroff, Aditya Pancholi, Swarangi Mahar...          India    January 1, 2018          2012  TV-14    103 min                       Dramas, International Movies  A schoolteacher known for his good deeds and b...         5                    Dramas
2877   s2878    Movie                            Hush      Mike Flanagan  John Gallagher Jr., Kate Siegel, Michael Trucc...  United States      April 8, 2016          2016      R     82 min                           Horror Movies, Thrillers  A deaf writer who retreated into the woods to ...         5             Horror Movies
2880   s2881  TV Show                   Hymn of Death                NaN  Lee Jong-suk, Shin Hye-sun, Kim Myeong-su, Par...    South Korea  December 14, 2018          2018  TV-14   1 Season  International TV Shows, Korean TV Shows, Roman...  During the Japanese colonial period, married p...         9    International TV Shows

In [112]:
df_netflix[(df_netflix['title'][0]=='H') & (df_netflix['title'][0]=='h')]

KeyError: ignored

What is the Mean Absolute Deviation of the Votes column? 

Note: Make sure you have not dropped Null values. 

The dataset can be imported as pandas dataframe using the following link: https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/zomato.csv

In [100]:
df_zomato = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/zomato.csv', encoding='latin-1')

In [110]:
df_zomato['Votes'].mad(axis=0, skipna=False)

193.46493877036863

In [105]:
df_zomato['Votes'].notnull().sum()

9551

###VideoGameSales
Which of the following platform saw the lowest percentage increase (positive) in global sales volume of games from 2013 to 2014? Note: Global sales can be calculated as the sum of sales of all the regions in the dataset. 

The dataset can be imported as pandas dataframe using the following link: https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/VideoGameSales.csv

reference:
https://kanoki.org/2019/03/27/pandas-select-rows-by-condition-and-string-operations/
https://stackoverflow.com/questions/41689722/how-to-select-rows-that-do-not-start-with-some-str-in-pandas/41689928

In [123]:
df_videogames = pd.read_csv('https://raw.githubusercontent.com/insaid2018/INSAID-Activities/main/Data%20Detective%20Challenge/VideoGameSales.csv')

In [124]:
df_videogames.head()

   Rank                      Name Platform    Year         Genre Publisher  NA_Sales_Volume  EU_Sales_Volume  JP_Sales_Volume  Other_Sales_Volume
0     1                Wii Sports      Wii  2006.0        Sports  Nintendo            41.49            29.02             3.77                8.46
1     2         Super Mario Bros.      NES  1985.0      Platform  Nintendo            29.08             3.58             6.81                0.77
2     3            Mario Kart Wii      Wii  2008.0        Racing  Nintendo            15.85            12.88             3.79                3.31
3     4         Wii Sports Resort      Wii  2009.0        Sports  Nintendo            15.75            11.01             3.28                2.96
4     5  Pokemon Red/Pokemon Blue       GB  1996.0  Role-Playing  Nintendo            11.27             8.89            10.22                1.00